{
    "todo":[
        "Améliorer les execptions levées lors du calcul des exp, sqrt, log... sans planter le calcul!",
        "Alert si densité nulle sur plage d'étude",
        "Problème radar : la zone rouge déborde",
        "Calib : HPD et valeurs numériques + export image et data",
        "CSV Import : marquer lignes importées",
        "Save zoom and scene scroll position in project settings",
        "calib AM et C14 : coeff devant exponentielle à vérifier car sigma dépend de t (utilise l’erreur e de la courbe de calibration)",
        "somme des gamma sur une branche inférieur à plage d’étude : alerte sinon",
        "Résoudre les problèmes d’affichage des graduation en X et Y pour les graphs",
        "Enrichir l’aide contextuelle en général",
        "clic sur date doit sélectionner le fait",
        "Sauvegarder les résultats de calcul dans un fichier binaire.",
        "Tester le produit sur les systèmes 32 / 64 bits",
        "Opération inverse de l’import CSV : export d’un modèle entré à la main",
        "Changer la courbe de calibration C14 pour tous les data d’un coup ?",
        "Détecter au maximum les conflits de contraintes avant le calcul",
        "Bouton RESET MCMC : remet toutes les méthodes par défaut des events et data.",
        "Initialisation MCMC pour bounds",
        "Intervalles HPD : à partir de quel écart entre les intervalles faut-il les regrouper ?",
        "Bound dans la scène des phase ?? (pour limiter le nombre de flèches du côté des faits)… (question du mail du 18/11)",
        "Nuage de points de corrélation entre 2 chaines ? (=> dans R ?)"
    ],
    "done":[
        "undo / redo events refresh?",
        "Step : calcul automatique forçable par utilisateur",
        "Enlever curseurs pour captures d’ecran",
        "gamma dans bulle : signe « > »",
        "phase : tau doit s’afficher dans les items",
        "titre au-dessus des graphs quand déplié? pour export image sans barre de gauche…",
        "wiggle : que pour dates autoriséees et si pas nul",
        "bruitage de l’acceptation : OK ! Mais taille de batch >= 100",
        "calibration affichage dans les résultats avec un step : problème sur gaussiennes et créneau",
        "Attaques verticales sur HPD et calibrations",
        "Phases : stocker betai - alphai puis calculer intervalle de credibilité. Afficher cet interval correspondant à la durée de la phase, non situable sur le graph (entre les moyennes de alpha et de beta n’a pas de justification)",
        "Enlever Wiggle matching dans controls results",
        "Pouvoir définir les graines manuellement (random sinon)",
        "FFT : l’estimateur à noyau retourne une densité mais l’aire obtenue est différente de 1 (beaucoup plus grande)",
        "FFT sur buffer de tailler fixe (1024 par exemple) pour gérer les grandes périodes d’étude",
        "Initialisation MCMC (sauf pour bounds)",
        "La suppression des phases fait planter l’appli (bug aléatoire…)",
        "Contraintes de faits : dessiner une croix rouge pour proposer la destruction",
        "Bound : supprimer l’option Gaussienne",
        "Bound : sélection visuelle identique aux autres objets",
        "Bound : dessiner les phases auquelles elles appartiennent",
        "Utiliser des valeurs décimales pour les bounds",
        "Effacer les résultats à l’ouverture / création d’un nouveau projet.",
        "Stocker les résultats des distribution translatées par le wiggle",
        "Afficher la distribution ti + deltai s’il y a du wiggle (en option, comme calibration)",
        "Créer le script pour l’installeur Mac",
        "Créer le script pour l’installeur Windows",
        "Import CSV : delta range ou gaussien à ajouter",
        "Calibration : afficher les erreurs en pointillés",
        "Liste des dates : ajouter boutons (calibrer & modifier). Actuellement le clic simple ouvre la calibration et le double-clic la modification, mais pas pratique à l’usage !",
        "Améliorer la modification de Tau et Gamma.",
        "Mettre en avant les boutons permettant de dérouler les graphs et d’afficher les résultats numériques.",
        "Résoudre le bug d’affichage sous les graphs lorsqu’on les replie.",
        "Exporter les données des graphs en colonnes dans les CSV",
        "Capture d’écran globale des résultats",
        "Supprimer les marges entre les graphs de résultats lorsqu’on les « écrase »",
        "Aligner les boutons à gauche des graphs quand on les écrase",
        "Supprimer la variable phi (contraintes de faits)",
        "Intervalles de confiance affiché pour les alpha-beta des phases",
        "Trait entre la moyenne de alpha et la moyenne de beta, en pointillé car différent de crédibilté (il s’agit plus de la durée estimée)",
        "Auto-corrélation : problème de calcul",
        "Intervalle de crédibilité peu cédible…",
        "Résultats de calcul : max Y est supprimé car inutile",
        "Dichotomie pour g(theta i)",
        "FFTW : tronquer resultat sur plage d’étude",
        "Taux d’accept global de la phase d’acquisition calculé dans les résultats numériques",
        "Acceptation : écrire méthode utilisée sur le graph",
        "Phases : click sur item : sélectionner les évènements. => par contre, si click sur checkbox de la phase, pas de sélection des faits!",
        "Bouton oeil dans la phase pour griser les faits pas dedans (possible d’avoir l’oeil actif sur plusieurs phases)",
        "Study begin / study end + message au départ pour les renseigner + défaut à 0 et interdire toute action tant que à 0",
        "L’aire doit être 1 sous les courbes de calibration",
        "Résultats disparaissent si Run lorsqu’on regarde déjà les résultats",
        "Import data : les mauvaises lignes disparraissent au glisser-déposer",
        "date AM : error = 1 par défaut",
        "Windows : Installer FFTW => générer .lib à partir de .def (installer Visual)",
        "gestion des projets plus claire…",
        "permettre de travailler avec un pas variable, et pas que à l’année => OK pour calib",
        "import data : noms des colonnes dans le tableau",
        "graduations sur axe Y",
        "quadrillage des graphs",
        "Zoom global sur calibration",
        "Windows : Icône sur Windows",
        "Windows : Resize issue at launch",
        "Prendre en compte les Bound dans le calcul : updateTheta",
        "Sortie des variances superposées pour le fait",
        "Combine & Split",
        "export des datas des graphs",
        "export des images des graphs",
        "Calibration : sur l’axe y, il faut toujours voir la mesure verticale même si elle ne rencontre pas la courbe de référence",
        "Isoler la barre de titre de l’appli (permettant de déplacer la fenêtre) de la barre d’outils en-dessous",
        "Améliorer le comportement des flèches dans la scène"
    ]
}