[
    {
        "version": "0.2",
        "mac": "releases/chronomodel_mac_0.2.pkg",
        "win": "releases/chronomodel_win_0.2.exe",
        "date": "12/01/2015",
        "done": [
            "Correction sur les calcul HPD pour prendre en compte les densités symétriques.",
            "Correction sur la création de la courbe de répartition (qui corrige notamment le calcul des quartiles lors de la calibration).",
            "Travail entamé : ouverture d'un fichier au glisser-déposer sur l'icône de l'application.",
            "Pas d'interpolation au limites des créneaux.",
            "Nouveaux icônes.",
            "Ajustement de la fenêtre des logs.",
            "Nouveaux icônes pour la fenêtre des résultats.",
            "Affichage de la trace en respectant le thinning sur l'échelle lors de l'acquisition. Affichage de toutes les itérations pour burn et adapt.",
            "Meilleur affichage de l'aperçu des bornes dans la fenêtre de propriétés.",
            "Optimisation de l'affichage des graphs avec données vecteur (sous-échantillonage pour accélération).",
            "meilleur affichage des aperçus des bornes dans la scène"
        ]
    },
    {
        "version": "0.1",
        "mac": "releases/chronomodel_mac_0.1.pkg",
        "win": "releases/chronomodel_win_0.1.exe",
        "date": "11/01/2015",
        "done": [
            "Librairies Linux ajoutées pour le déploiement",
            "Modification de la license et du fichier de présentation dans l'installeur",
            "Correction du problème de quartiles décalés pour les dates calibrées",
            "Utilisation de 5000 points au lieu de 600 pour les courbes de mesure verticales : permet d'avoir suffisamment de points pour dessiner la courbe quand le zoom en Y est grand",
            "Undo/Redo boutons sans texte et désactivation de la vue undo/redo",
            "Bug corrigé : pas de dialogue sur le step à la fermeture du projet",
            "Activation correcte des boutons de la barre principale en fonction de l'ouverture/fermeture des projets",
            "Correction majeure d'un bug sur les HPD lié aux QMaps (corrige le HPD de la calibration)",
            "Correction du layout de la vue calibration et ajout de l'export visuel",
            "Positionnement des nouveaux events au milieu de la partie visualisée de la scène + sélection auto pour travailler dessus",
            "Rafraississement à la création de contraintes",
            "Activation du bouton Run que si nécessaire",
            "Sauvegarde des zooms par onglets dans la vue des résultats.",
            "Pas de perte du zoom quand on change les options (chaines, hpd, raw results...)",
            "Positionnement des nouvelles phases au milieu de la vue.",
            "Couleurs aléatoires proposées sur tout le spectre.",
            "Flèches grisées quand on clique sur l'oeil d'une phase.",
            "Affichage de la grille rétabli",
            "Menu ajouté : reset de toutes les méthodes MCMC sur events et data",
            "Adaptation des item dans la scène en fonction du zoom (si trop petit, dates pas affichées sur les events et contrôles pas affichés sur les phases)",
            "Option affichage de la grille restaurée",
            "Le changement de nom ou de couleur dans le modèle est mis à jour dans les résultats au basculement vers la vue des résultats.",
            "Résultats numériques affichés sous les graphs de résultat.",
            "Le bouton update display remet à jour les résultats (noms et couleurs) en respectant la position y dans le model,.",
            "L'échelle Y s'adapte en fonction du zoom X pour les traces, et les densités des variances.",
            "Correction affichage des graphs : les crédibilités ne débordent pas du cadre.",
            "Nouveaux icônes"
        ]
    },
    {
        "version": "0.0.9",
        "mac": "releases/chronomodel_mac_0.0.9.pkg",
        "win": "releases/chronomodel_win_0.0.9.exe",
        "date": "07/01/2015",
        "done": [
            "Scènes toujours ajustées au minimum nécessaire, mais impossible de suivre les éléments que l'on sort de la vue (comportement Qt inadapté).",
            "Dessin du fond de la scène en blanc.",
            "Graph tool tip restored for HD and SD display",
            "Correction du H factor (il manquait un facteur...)",
            "Initialisation de sigma MH pour les events",
            "Correction d'un bug sur la validité du modèle avec durées de phases",
            "Scènes : la grille peut être affichée ou non",
            "Demande confirmation avant de quitter l'application",
            "Résultats : zoom ok dans les 2 directions",
            "Bouton ajouté pour les options de plugins",
            "Export des datas du modèle en CSV.",
            "Import CSV : les lignes sont marquées en vert (au lieu de disparaître) quand une donnée est importée",
            "Nettoyage propre des scènes lors de la réinitialisation de l'interface.",
            "La calibration ne disparaît plus lorqu'on redimensionne la fenêtre.",
            "Correction du bug dans la liste des dates : les boutons modify et calibrate devenaient inclicables!",
            "Scroll et zoom ok sur la calibration",
            "Les Graphs peuvent ajuster automatiquement le zoom en Y lorsqu'on scroll en X",
            "Le dessin des axes a son propre objet à présent",
            "Ajustement graphique de l'aide sur le wiggle",
            "Dialog spécial (et à modifier à l'avenir) pour les propriétés de plugin.",
            "Les fonctions qu'il présentent devraient être factorisées dans les plugins (voir code)",
            "La période d'étude doit toujours être valide. Une alerte est systématique sinon!",
            "Les courbes de référence C14 peuvent être changées d'un coup.",
            "Les formulaires des plugins permettent de savoir si les données entrées sont correctes à la création/modification d'une date",
            "L'aperçu de calib n'est pas un histogramme mais une densité, avec une exception pour les typo. ref. (pas de trapèze)",
            "Correction d'un bug sur les phases...",
            "Log du modèle et du MCMC affichés en sortie"
        ]
    },
    {
        "version": "0.0.8",
        "mac": "releases/chronomodel_mac_0.0.8.pkg",
        "win": "releases/chronomodel_win_0.0.8.exe",
        "date": "30/12/2014",
        "done": [
            "Passage float => double",
            "Optimisation de l'affichage des graphs utilisant des vecteurs de données",
            "GraphView class : ré-écriture / nettoyage + ajout de HD/SD rendering + affichage des axes avec uniquement les valeurs min/max possible",
            "Sauvegarde des résultats dans un fichier de données compressé, rechargé à l'ouverture du projet",
            "C14 : mémorisation de la dernière courbe choisie",
            "Vidage des corbeilles possible",
            "On quitte la fenêtre de calibration si une modification est enregistrée",
            "Classement des phases selon leur position Y dans la scène",
            "Correction des getThetaMin et Max : on utilise uniquement les events déjà initialisés (ce n'était pas le cas pour les phases...)",
            "Log HTML du modèle (à continuer...)",
            "Raw data affichées au-dessus de la densité",
            "Help ajouté pour les params MCMC et le Wiggle (dans les dialogues)"
        ]
    },
    {
        "version": "0.0.7",
        "win": "releases/chronomodel_win_0.0.7.exe",
        "date": "23/12/2014",
        "done": [
            "Correction pour la génération des buffers FFT et raw : le delta est calculé avec (nbPts - 1) et le cas de la dernière valeur du buffer est bien géré.",
            "Bouton Apply de la plage d'études prend la bonne couleur au bon moment (!)",
            "Espace ajouté entre les sections dans les résultats",
            "Sélection d'éléments de la scène mise à jour après destruction d'un fait.",
            "Dessin de la scène rafraichi correctement lors de undo/redo successifs",
            "Quand on ferme un projet puis qu'on en créé un nouveau, pas de demande de sauvegarde inutile.",
            "La calibration d'une date nulle ne bloque plus l'affichage",
            "Le MCMC s'arrête avec un message si une date nulle est rencontrée lors de la calibration",
            "Calibrations C14 et AM corrigées pour fonctionner avec un pas de calibration non entier",
            "Le pas de calibration est bien lu dans le json comme float (et non int!!)"
        ]
    },
    {
        "version": "0.0.6",
        "win": "releases/chronomodel_win_0.0.6.exe",
        "date": "22/12/2014",
        "done": [

            "Validation du modèle au lancement des calculs (10 conditions à vérifier sur les contraintes, les durées, les bornes, ...) et ajustement des intervalles des bornes",
            "Initialisation des bornes dans l'ordre stratigraphique.",
            "Affichage des résultats : HPD toujours visible, possibilité de cacher la crédibilité.",
            "Crédibilité non calulée pour 0% (!)",
            "La préférence permettant de ré-ouvrir ou non le dernier projet au lancement de l'application fonctionne.",
            "La calbration utilise un tableau et plus une QMap : passage des valeurs en index et plus en clef (devrait légèrement accélérer les calculs par rapport à la version précédente)",
            "La plage d'étude doit être définie avant de passer aux onglets Phases et Import",
            "Affichage des résultats : ajout d'un facteur réglable pour faire varier H, utilisé pour le lissage FFT",
            "Le step de calibration est calculé automatiquement en fonction de la plage d'étude selon une loi exponentielle saturante (linéaire jusqu'à 10000 pts, saturation à 50000 pts)",
            "Plugins Gauss et TL utilisent Gauss Adapt par défault",
            "Phase d'adaptation acceptée si tous les taux d'acceptation des variables utilisant le gaussien adaptatif sont dans [41%; 47%] (avant : [42%; 46%])"
        ]
    },
    {
        "version": "0.0.5",
        "mac": "releases/chronomodel_mac_0.0.5.pkg",
        "win": "releases/chronomodel_win_0.0.5.exe",
        "date": "16/12/2014",
        "done": [
            "Graph axis display improved",
            "Step dialog added to project",
            "Better computation of Raw results (using same function for raw and fft results)",
            "Graph display improved for histos (bars centered) and HPD",
            "Calibration resolution auto calculated and can be forced by user",
            "Special characters used",
            "Image export uses subrect source correctly (Still a bug on image top left??)",
            "Better gamma and Tau display on phases scene",
            "Graphs Typo and HPD with vertical lines",
            "Raw results option in results",
            "Numerical results with title",
            "Title added on top of graph when height is sufficient",
            "Old wiggle radio but removed",
            "Spinbox for batch length",
            "Phase duration credibility and wiggle visualisation",
            "Date likelihood from calib uses step! => This correct a bug in results view : calibration had extra points with value = 0, created when interpolating calib with unexisting points"
        ]
    },
    {
        "version": "0.0.4",
        "mac": "releases/chronomodel_mac_0.0.4.pkg",
        "date": "14/12/2014",
        "done": [
            "Event Selection not lost anymore when modifying it",
            "MCMC settings with calib step and fft size",
            "FFT size changeable in results",
            "FFT computed on exact buffer length (there was a bug sometimes, using 1025 points...)",
            "Results generation factorized"
        ]
    },
    {
        "version": "0.0.3",
        "mac": "releases/chronomodel_mac_0.0.3.pkg",
        "win": "releases/chronomodel_win_0.0.3.exe",
        "date": "09/12/2014",
        "done": [
            "FFT, correlation and credibility updated",
            "MCMC corrected : there was a major bug when updating events in phases with gamma!",
            "doubleExp debug help => Infinity issue is still here...",
            "DoubleExp works with double values (64 bits) to avoid infinity issues",
            "Exception raised if exp breaks code"
        ]
    },
    {
        "version": "0.0.2",
        "mac": "releases/chronomodel_mac_0.0.2.pkg",
        "win": "releases/chronomodel_win_0.0.2.exe",
        "date": "03/12/2014",
        "done": [
            "Application Settings updated with CSV preferences",
            "CSV import/export using preferences",
            "App Settings dialog redrawn",
            "Results graphs data cdv export in columns",
            "Hight-DPI screenshots (for Retina screens)",
            "Global results view exports",
            "Fixed Fold / Unfold results display issue (graphs were still a bit visible in folded state)",
            "Grouped display options in results",
            "Calibration measure errors displayed by all plugins",
            "Buttons in data list for update and calibration",
            "Calibration layout improved",
            "Calibration : quartiles calculated from repartition",
            "Bounds : fixed values displayed in results as dirac (as well as in scene preview)",
            "Model class uses pointers to Events and Phases : easier to cast events to bounds",
            "Float maths functions used instead of double version",
            "Event Dialog title ok with bounds",
            "New Init (Still not working with bounds)",
            "Project Settings can be copied now!",
            "Arrows in scenes now use shape instead of boundingRect for collision detection, allowing interaction with the mouse when they cross each other : the focus is given to the closest one. This could still be improved though.",
            "Warning removed",
            "Bounds : Gauss option removed",
            "Results view disabled if run has not been done, or if a new project is opened",
            "Constraints position update improved",
            "Help restored in scene",
            "Phase deletion updated (items refresh improved)",
            "PHASES UPDATE SEGFAULT FIXED !!! => very weird solution (Qt bug???)",
            "Button state updated (red or green)",
            "Project can be closed from menu",
            "Study period management and display improved"
        ]
    },
    {
        "version": "0.0.1",
        "mac": "releases/chronomodel_mac_0.0.1.pkg",
        "win": "releases/chronomodel_win_0.0.1.exe",
        "date": "26/11/2014",
        "done": [
            "Repartition curve normalized (solves problem when evaluating dates with g(theta i)",
            "CSV Import modified for AM : more simple, but breaks old project!",
            "Added DensityAnalysis for numerical results",
            "Wiggle stored and displayed at the end",
            "Auto-correlation improved",
            "Date description depends on plugin now (not generic json display anymore)",
            "Calib pixmap generation externalized from calibration process",
            "Wiggle displayed in date list only when necessary and in correct format",
            "Graphs : axis with arrow drawn",
            "Calib view : ref curves drawn only where they exist",
            "Added Calib numerical results",
            "Buttons displayed inline in results graphs left side",
            "constraints and phases edition fixed",
            "results grouped by phase : correct events displayed",
            "Minor fixes on Phase editing and CSV imports",
            "Calib paths modified on Mac"
        ]
    },
    {
        "version": "0.0.0",
        "mac": "releases/chronomodel_mac_0.0.0.pkg",
        "win": "releases/chronomodel_win_0.0.0.exe",
        "date": "24/11/2014",
        "done": [

        ]
    }
]